# # 1
#
# n = int(input("შემოიტანე რიცხვი: "))
#
# sum = 0
#
# # აქ არ დაგიკონკრეტებიათ "1-დან n-მდე" -ში რა იგულისხმება:
# # 1 - ის ჩათვლით თუ არა და n - ის ჩათვლით თუ არა
# # ამიტომ 1 და n ორივეს ის ჩათვლით ვიანგარიშე
# for i in range(1, n + 1):
#     sum += i
#
# print(f"1-დან {n}-მდე რიცხვების ჯამია არის: {sum}")

# # 2
#
# n = int(input("შემოიტანე რიცხვი: "))
#
# while n > 0:  # ან შეგვიძლია n != 0 ან თუნდაც n >= 1
#     print(n)
#     n -= 1

# 3

# n = 10
#
# while True:
#     guess = int(input("შეიყვანე რიცხვი: "))
#
#     if guess == n:
#         print(f"თქვენ გამოიცანით რიცხვი")
#         break
#     elif guess < n:
#         print("ვერ გამოიცანი, ჩაფიქრებული რიცვი შეტანილ რიცხვზე მეტია")
#     else:
#         print("ვერ გამოიცანი, ჩაფიქრებული რიცვი შეტანილ რიცხვზე ნაკლებია")

# # 4
#
# total_sum = 0
#
# while True:
#     n = input("შეიყვანეთ რიცხვები ან 'sum' შეყვანილი რიცხვების ჯამისთვის: ")
#
#     if n == 'sum':
#         break
#
#     nFloat = float(n)
#
#     if nFloat > 0:
#         total_sum += nFloat
#
# print(f"\nშეყვანილი დადებითი რიცხვების ჯამი: {total_sum}")






